package interfaces;
import java.util.Map;

/**
 * Интерфейс, който дефинира ред в таблица. Той предоставя методи за достъп до атрибутите на реда, които се състоят от колони и стойности.
 */
public interface Row {

    /**
     * Връща атрибутите на реда, представени като карта (map) от колони и стойности.
     * Ключовете в картата са обекти от тип {@link Column}, а стойностите са низове, които представляват данните в колоните.
     *
     * @return карта с атрибутите на реда
     */
    Map<Column,String> getAttributes();
}
